Revit 2027 API
HasValueFilterRule Constructor
 constructs an instance of HasValueFilterRule.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public HasValueFilterRule(
	ElementId parameter
)
Public Sub New (
	parameter As ElementId
)
public:
HasValueFilterRule(
	ElementId^ parameter
)
new :
        parameter : ElementId -> HasValueFilterRule
Parameters
parameter ElementId
 The parameter that an element must have a value for to pass this rule.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
HasValueFilterRule Class
Autodesk.Revit.DB Namespace